{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "317": 0,
      "204": 1,
      "103": 2,
      "734": 3,
      "925": 4,
      "246": 5,
      "851": 6,
      "307": 7,
      "394": 8,
      "405": 9,
      "253": 10,
      "179": 11,
      "899": 12,
      "984": 13,
      "743": 14,
      "227": 15,
      "189": 16,
      "305": 17,
      "911": 18,
      "457": 19,
      "664": 20,
      "881": 21,
      "353": 22,
      "225": 23,
      "461": 24,
      "159": 25,
      "632": 26,
      "289": 27,
      "275": 28,
      "370": 29,
      "451": 30,
      "628": 31,
      "656": 32,
      "796": 33,
      "544": 34,
      "725": 35,
      "785": 36,
      "176": 37,
      "758": 38,
      "787": 39,
      "477": 40,
      "771": 41,
      "435": 42,
      "1015": 43,
      "446": 44,
      "824": 45,
      "747": 46,
      "561": 47,
      "213": 48,
      "990": 49,
      "311": 50,
      "963": 51,
      "858": 52,
      "420": 53,
      "868": 54,
      "511": 55,
      "961": 56,
      "70": 57,
      "47": 58,
      "694": 59,
      "114": 60,
      "243": 61,
      "634": 62,
      "568": 63,
      "873": 64,
      "746": 65,
      "322": 66,
      "490": 67,
      "164": 68,
      "955": 69,
      "1014": 70,
      "13": 71,
      "756": 72,
      "185": 73,
      "874": 74,
      "209": 75,
      "596": 76,
      "584": 77,
      "110": 78,
      "18": 79,
      "669": 80,
      "44": 81,
      "652": 82,
      "217": 83,
      "383": 84,
      "315": 85,
      "65": 86,
      "956": 87,
      "6": 88,
      "277": 89,
      "934": 90,
      "265": 91,
      "654": 92,
      "157": 93,
      "234": 94,
      "93": 95,
      "506": 96,
      "536": 97,
      "770": 98,
      "845": 99,
      "581": 100,
      "248": 101,
      "386": 102,
      "576": 103,
      "704": 104,
      "786": 105,
      "668": 106,
      "821": 107,
      "509": 108,
      "495": 109,
      "223": 110,
      "906": 111,
      "989": 112,
      "683": 113,
      "474": 114,
      "59": 115,
      "878": 116,
      "430": 117,
      "987": 118,
      "962": 119,
      "29": 120,
      "702": 121,
      "764": 122,
      "518": 123,
      "727": 124,
      "617": 125,
      "818": 126,
      "788": 127,
      "166": 128,
      "768": 129,
      "456": 130,
      "507": 131,
      "26": 132,
      "649": 133,
      "470": 134,
      "626": 135,
      "541": 136,
      "978": 137,
      "449": 138,
      "356": 139,
      "22": 140,
      "829": 141,
      "912": 142,
      "543": 143,
      "422": 144,
      "1005": 145,
      "400": 146,
      "542": 147,
      "760": 148,
      "1012": 149,
      "365": 150,
      "850": 151,
      "817": 152,
      "476": 153,
      "154": 154,
      "106": 155,
      "484": 156,
      "622": 157,
      "951": 158,
      "828": 159,
      "31": 160,
      "318": 161,
      "294": 162,
      "481": 163,
      "856": 164,
      "145": 165,
      "178": 166,
      "685": 167,
      "72": 168,
      "882": 169,
      "513": 170,
      "682": 171,
      "526": 172,
      "537": 173,
      "980": 174,
      "130": 175,
      "923": 176,
      "792": 177,
      "663": 178,
      "366": 179,
      "368": 180,
      "625": 181,
      "349": 182,
      "438": 183,
      "575": 184,
      "691": 185,
      "429": 186,
      "270": 187,
      "600": 188,
      "391": 189,
      "620": 190,
      "1003": 191,
      "876": 192,
      "712": 193,
      "855": 194,
      "372": 195,
      "889": 196,
      "152": 197,
      "607": 198,
      "187": 199,
      "174": 200,
      "299": 201,
      "551": 202,
      "778": 203,
      "615": 204,
      "240": 205,
      "442": 206,
      "996": 207,
      "932": 208,
      "402": 209,
      "219": 210,
      "610": 211,
      "560": 212,
      "885": 213,
      "789": 214,
      "842": 215,
      "974": 216,
      "864": 217,
      "835": 218,
      "228": 219,
      "271": 220,
      "33": 221,
      "748": 222,
      "944": 223,
      "148": 224,
      "293": 225,
      "98": 226,
      "558": 227,
      "221": 228,
      "290": 229,
      "504": 230,
      "113": 231,
      "1017": 232,
      "1021": 233,
      "739": 234,
      "94": 235,
      "80": 236,
      "723": 237,
      "924": 238,
      "865": 239,
      "938": 240,
      "613": 241,
      "140": 242,
      "582": 243,
      "203": 244,
      "387": 245,
      "979": 246,
      "997": 247,
      "61": 248,
      "603": 249,
      "0": 250,
      "804": 251,
      "180": 252,
      "852": 253,
      "907": 254,
      "172": 255,
      "206": 256,
      "111": 257,
      "86": 258,
      "331": 259,
      "4": 260,
      "769": 261,
      "1002": 262,
      "814": 263,
      "606": 264,
      "25": 265,
      "805": 266,
      "866": 267,
      "553": 268,
      "15": 269,
      "418": 270,
      "715": 271,
      "609": 272,
      "538": 273,
      "527": 274,
      "816": 275,
      "390": 276,
      "592": 277,
      "687": 278,
      "381": 279,
      "133": 280,
      "737": 281,
      "798": 282,
      "160": 283,
      "480": 284,
      "32": 285,
      "324": 286,
      "471": 287,
      "337": 288,
      "239": 289,
      "977": 290,
      "396": 291,
      "173": 292,
      "744": 293,
      "740": 294,
      "886": 295,
      "17": 296,
      "162": 297,
      "519": 298,
      "300": 299,
      "565": 300,
      "224": 301,
      "815": 302,
      "139": 303,
      "959": 304,
      "662": 305,
      "443": 306,
      "97": 307,
      "895": 308,
      "883": 309,
      "482": 310,
      "1020": 311,
      "274": 312,
      "291": 313,
      "118": 314,
      "577": 315,
      "259": 316,
      "453": 317,
      "287": 318,
      "499": 319,
      "927": 320,
      "681": 321,
      "79": 322,
      "117": 323,
      "66": 324,
      "750": 325,
      "910": 326,
      "236": 327,
      "131": 328,
      "547": 329,
      "894": 330,
      "1010": 331,
      "726": 332,
      "960": 333,
      "388": 334,
      "971": 335,
      "696": 336,
      "572": 337,
      "171": 338,
      "316": 339,
      "1023": 340,
      "877": 341,
      "761": 342,
      "1004": 343,
      "242": 344,
      "503": 345,
      "514": 346,
      "222": 347,
      "524": 348,
      "323": 349,
      "957": 350,
      "711": 351,
      "627": 352,
      "377": 353,
      "55": 354,
      "69": 355,
      "772": 356,
      "782": 357,
      "833": 358,
      "469": 359,
      "378": 360,
      "452": 361,
      "823": 362,
      "339": 363,
      "699": 364,
      "238": 365,
      "310": 366,
      "120": 367,
      "585": 368,
      "633": 369,
      "397": 370,
      "199": 371,
      "903": 372,
      "141": 373,
      "559": 374,
      "556": 375,
      "74": 376,
      "465": 377,
      "421": 378,
      "988": 379,
      "892": 380,
      "666": 381,
      "272": 382,
      "1011": 383,
      "732": 384,
      "970": 385,
      "781": 386,
      "810": 387,
      "68": 388,
      "186": 389,
      "165": 390,
      "12": 391,
      "3": 392,
      "630": 393,
      "569": 394,
      "982": 395,
      "263": 396,
      "334": 397,
      "38": 398,
      "8": 399,
      "104": 400,
      "374": 401,
      "64": 402,
      "198": 403,
      "464": 404,
      "690": 405,
      "75": 406,
      "45": 407,
      "450": 408,
      "601": 409,
      "478": 410,
      "286": 411,
      "210": 412,
      "921": 413,
      "260": 414,
      "608": 415,
      "863": 416,
      "41": 417,
      "268": 418,
      "650": 419,
      "281": 420,
      "16": 421,
      "590": 422,
      "846": 423,
      "147": 424,
      "557": 425,
      "191": 426,
      "598": 427,
      "144": 428,
      "838": 429,
      "302": 430,
      "948": 431,
      "629": 432,
      "108": 433,
      "721": 434,
      "733": 435,
      "410": 436,
      "433": 437,
      "1018": 438,
      "14": 439,
      "797": 440,
      "401": 441,
      "908": 442,
      "533": 443,
      "87": 444,
      "811": 445,
      "579": 446,
      "158": 447,
      "150": 448,
      "887": 449,
      "983": 450,
      "791": 451,
      "498": 452,
      "926": 453,
      "836": 454,
      "640": 455,
      "840": 456,
      "966": 457,
      "591": 458,
      "880": 459,
      "693": 460,
      "968": 461,
      "382": 462,
      "703": 463,
      "949": 464,
      "82": 465,
      "779": 466,
      "392": 467,
      "618": 468,
      "379": 469,
      "52": 470,
      "455": 471,
      "529": 472,
      "790": 473,
      "520": 474,
      "832": 475,
      "563": 476,
      "802": 477,
      "500": 478,
      "623": 479,
      "169": 480,
      "273": 481,
      "296": 482,
      "780": 483,
      "371": 484,
      "517": 485,
      "99": 486,
      "604": 487,
      "380": 488,
      "92": 489,
      "39": 490,
      "820": 491,
      "1019": 492,
      "849": 493,
      "257": 494,
      "330": 495,
      "707": 496,
      "486": 497,
      "350": 498,
      "665": 499,
      "475": 500,
      "822": 501,
      "463": 502,
      "1022": 503,
      "346": 504,
      "671": 505,
      "212": 506,
      "809": 507,
      "112": 508,
      "946": 509,
      "215": 510,
      "407": 511,
      "327": 512,
      "619": 513,
      "101": 514,
      "284": 515,
      "708": 516,
      "329": 517,
      "545": 518,
      "90": 519,
      "252": 520,
      "116": 521,
      "916": 522,
      "729": 523,
      "929": 524,
      "657": 525,
      "941": 526,
      "692": 527,
      "251": 528,
      "807": 529,
      "385": 530,
      "351": 531,
      "196": 532,
      "335": 533,
      "306": 534,
      "719": 535,
      "736": 536,
      "417": 537,
      "467": 538,
      "757": 539,
      "208": 540,
      "231": 541,
      "502": 542,
      "413": 543,
      "127": 544,
      "698": 545,
      "616": 546,
      "766": 547,
      "621": 548,
      "801": 549,
      "918": 550,
      "639": 551,
      "827": 552,
      "605": 553,
      "952": 554,
      "532": 555,
      "578": 556,
      "216": 557,
      "237": 558,
      "202": 559,
      "42": 560,
      "525": 561,
      "647": 562,
      "135": 563,
      "564": 564,
      "893": 565,
      "830": 566,
      "831": 567,
      "986": 568,
      "205": 569,
      "597": 570,
      "361": 571,
      "84": 572,
      "288": 573,
      "534": 574,
      "950": 575,
      "731": 576,
      "717": 577,
      "115": 578,
      "460": 579,
      "700": 580,
      "229": 581,
      "192": 582,
      "57": 583,
      "947": 584,
      "589": 585,
      "341": 586,
      "641": 587,
      "373": 588,
      "10": 589,
      "276": 590,
      "794": 591,
      "867": 592,
      "5": 593,
      "839": 594,
      "1007": 595,
      "508": 596,
      "684": 597,
      "808": 598,
      "678": 599,
      "857": 600,
      "505": 601,
      "1": 602,
      "434": 603,
      "1006": 604,
      "891": 605,
      "190": 606,
      "393": 607,
      "138": 608,
      "709": 609,
      "27": 610,
      "964": 611,
      "546": 612,
      "267": 613,
      "197": 614,
      "624": 615,
      "637": 616,
      "73": 617,
      "1016": 618,
      "763": 619,
      "806": 620,
      "675": 621,
      "566": 622,
      "680": 623,
      "181": 624,
      "659": 625,
      "898": 626,
      "60": 627,
      "638": 628,
      "862": 629,
      "922": 630,
      "958": 631,
      "23": 632,
      "479": 633,
      "128": 634,
      "795": 635,
      "399": 636,
      "672": 637,
      "593": 638,
      "999": 639,
      "395": 640,
      "427": 641,
      "834": 642,
      "928": 643,
      "653": 644,
      "614": 645,
      "742": 646,
      "436": 647,
      "136": 648,
      "122": 649,
      "661": 650,
      "562": 651,
      "994": 652,
      "256": 653,
      "933": 654,
      "151": 655,
      "406": 656,
      "161": 657,
      "102": 658,
      "738": 659,
      "448": 660,
      "992": 661,
      "146": 662,
      "939": 663,
      "728": 664,
      "494": 665,
      "897": 666,
      "411": 667,
      "363": 668,
      "85": 669,
      "539": 670,
      "752": 671,
      "875": 672,
      "516": 673,
      "853": 674,
      "975": 675,
      "531": 676,
      "77": 677,
      "332": 678,
      "695": 679,
      "279": 680,
      "765": 681,
      "132": 682,
      "837": 683,
      "35": 684,
      "930": 685,
      "308": 686,
      "969": 687,
      "493": 688,
      "255": 689,
      "235": 690,
      "129": 691,
      "326": 692,
      "100": 693,
      "247": 694,
      "352": 695,
      "645": 696,
      "754": 697,
      "670": 698,
      "860": 699,
      "861": 700,
      "24": 701,
      "919": 702,
      "163": 703,
      "357": 704,
      "11": 705,
      "648": 706,
      "124": 707,
      "249": 708,
      "459": 709,
      "20": 710,
      "444": 711,
      "76": 712,
      "245": 713,
      "548": 714,
      "96": 715,
      "336": 716,
      "292": 717,
      "773": 718,
      "345": 719,
      "67": 720,
      "730": 721,
      "705": 722,
      "432": 723,
      "468": 724,
      "244": 725,
      "521": 726,
      "940": 727,
      "37": 728,
      "784": 729,
      "767": 730,
      "367": 731,
      "439": 732,
      "137": 733,
      "153": 734,
      "195": 735,
      "285": 736,
      "724": 737,
      "398": 738,
      "188": 739,
      "844": 740,
      "312": 741,
      "95": 742,
      "211": 743,
      "320": 744,
      "1009": 745,
      "935": 746,
      "710": 747,
      "528": 748,
      "890": 749,
      "303": 750,
      "414": 751,
      "872": 752,
      "936": 753,
      "914": 754,
      "297": 755,
      "655": 756,
      "931": 757,
      "813": 758,
      "313": 759,
      "567": 760,
      "706": 761,
      "359": 762,
      "121": 763,
      "741": 764,
      "510": 765,
      "347": 766,
      "360": 767,
      "168": 768,
      "981": 769,
      "937": 770,
      "753": 771,
      "254": 772,
      "636": 773,
      "54": 774,
      "658": 775,
      "53": 776,
      "301": 777,
      "587": 778,
      "599": 779,
      "688": 780,
      "803": 781,
      "48": 782,
      "847": 783,
      "62": 784,
      "415": 785,
      "304": 786,
      "125": 787,
      "425": 788,
      "900": 789,
      "488": 790,
      "358": 791,
      "2": 792,
      "333": 793,
      "278": 794,
      "403": 795,
      "501": 796,
      "200": 797,
      "30": 798,
      "466": 799,
      "535": 800,
      "689": 801,
      "46": 802,
      "642": 803,
      "799": 804,
      "364": 805,
      "993": 806,
      "549": 807,
      "416": 808,
      "232": 809,
      "19": 810,
      "673": 811,
      "408": 812,
      "776": 813,
      "182": 814,
      "423": 815,
      "314": 816,
      "515": 817,
      "942": 818,
      "701": 819,
      "343": 820,
      "677": 821,
      "50": 822,
      "348": 823,
      "269": 824,
      "7": 825,
      "266": 826,
      "793": 827,
      "530": 828,
      "915": 829,
      "716": 830,
      "473": 831,
      "258": 832,
      "826": 833,
      "570": 834,
      "419": 835,
      "328": 836,
      "280": 837,
      "674": 838,
      "777": 839,
      "262": 840,
      "523": 841,
      "859": 842,
      "354": 843,
      "184": 844,
      "967": 845,
      "218": 846,
      "81": 847,
      "686": 848,
      "913": 849,
      "888": 850,
      "783": 851,
      "89": 852,
      "660": 853,
      "183": 854,
      "762": 855,
      "497": 856,
      "909": 857,
      "485": 858,
      "718": 859,
      "920": 860,
      "905": 861,
      "848": 862,
      "552": 863,
      "953": 864,
      "440": 865,
      "369": 866,
      "107": 867,
      "355": 868,
      "309": 869,
      "976": 870,
      "34": 871,
      "583": 872,
      "424": 873,
      "870": 874,
      "340": 875,
      "437": 876,
      "170": 877,
      "651": 878,
      "134": 879,
      "194": 880,
      "714": 881,
      "298": 882,
      "389": 883,
      "904": 884,
      "759": 885,
      "441": 886,
      "36": 887,
      "588": 888,
      "295": 889,
      "643": 890,
      "175": 891,
      "454": 892,
      "646": 893,
      "825": 894,
      "233": 895,
      "226": 896,
      "155": 897,
      "713": 898,
      "404": 899,
      "283": 900,
      "755": 901,
      "220": 902,
      "550": 903,
      "261": 904,
      "555": 905,
      "871": 906,
      "71": 907,
      "426": 908,
      "250": 909,
      "1001": 910,
      "917": 911,
      "58": 912,
      "487": 913,
      "869": 914,
      "720": 915,
      "230": 916,
      "21": 917,
      "573": 918,
      "338": 919,
      "635": 920,
      "483": 921,
      "325": 922,
      "123": 923,
      "774": 924,
      "722": 925,
      "9": 926,
      "749": 927,
      "431": 928,
      "412": 929,
      "126": 930,
      "28": 931,
      "667": 932,
      "105": 933,
      "679": 934,
      "264": 935,
      "973": 936,
      "63": 937,
      "879": 938,
      "193": 939,
      "745": 940,
      "595": 941,
      "945": 942,
      "998": 943,
      "445": 944,
      "362": 945,
      "775": 946,
      "580": 947,
      "991": 948,
      "901": 949,
      "843": 950,
      "697": 951,
      "109": 952,
      "375": 953,
      "241": 954,
      "800": 955,
      "167": 956,
      "954": 957,
      "812": 958,
      "384": 959,
      "51": 960,
      "612": 961,
      "492": 962,
      "841": 963,
      "428": 964,
      "462": 965,
      "631": 966,
      "282": 967,
      "207": 968,
      "602": 969,
      "119": 970,
      "321": 971,
      "43": 972,
      "1000": 973,
      "201": 974,
      "902": 975,
      "735": 976,
      "458": 977,
      "995": 978,
      "644": 979,
      "342": 980,
      "819": 981,
      "344": 982,
      "489": 983,
      "1013": 984,
      "143": 985
    },
    "unk_token": "<unk>"
  }
}