{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "317": 0,
      "204": 1,
      "246": 2,
      "851": 3,
      "925": 4,
      "734": 5,
      "307": 6,
      "394": 7,
      "253": 8,
      "179": 9,
      "899": 10,
      "743": 11,
      "227": 12,
      "984": 13,
      "189": 14,
      "911": 15,
      "457": 16,
      "664": 17,
      "881": 18,
      "225": 19,
      "461": 20,
      "632": 21,
      "289": 22,
      "370": 23,
      "451": 24,
      "628": 25,
      "656": 26,
      "796": 27,
      "725": 28,
      "544": 29,
      "785": 30,
      "176": 31,
      "758": 32,
      "477": 33,
      "787": 34,
      "771": 35,
      "1015": 36,
      "435": 37,
      "446": 38,
      "824": 39,
      "747": 40,
      "561": 41,
      "213": 42,
      "990": 43,
      "311": 44,
      "963": 45,
      "858": 46,
      "420": 47,
      "961": 48,
      "511": 49,
      "868": 50,
      "568": 51,
      "694": 52,
      "114": 53,
      "70": 54,
      "243": 55,
      "634": 56,
      "873": 57,
      "746": 58,
      "322": 59,
      "490": 60,
      "955": 61,
      "1014": 62,
      "164": 63,
      "13": 64,
      "756": 65,
      "874": 66,
      "209": 67,
      "110": 68,
      "18": 69,
      "584": 70,
      "596": 71,
      "669": 72,
      "652": 73,
      "217": 74,
      "383": 75,
      "315": 76,
      "65": 77,
      "956": 78,
      "6": 79,
      "277": 80,
      "934": 81,
      "265": 82,
      "654": 83,
      "157": 84,
      "234": 85,
      "594": 86,
      "93": 87,
      "845": 88,
      "386": 89,
      "786": 90,
      "506": 91,
      "248": 92,
      "770": 93,
      "581": 94,
      "576": 95,
      "704": 96,
      "536": 97,
      "668": 98,
      "821": 99,
      "509": 100,
      "495": 101,
      "223": 102,
      "906": 103,
      "989": 104,
      "683": 105,
      "430": 106,
      "962": 107,
      "987": 108,
      "878": 109,
      "474": 110,
      "29": 111,
      "702": 112,
      "764": 113,
      "518": 114,
      "617": 115,
      "727": 116,
      "818": 117,
      "788": 118,
      "166": 119,
      "768": 120,
      "456": 121,
      "507": 122,
      "26": 123,
      "541": 124,
      "470": 125,
      "626": 126,
      "649": 127,
      "978": 128,
      "449": 129,
      "356": 130,
      "912": 131,
      "829": 132,
      "22": 133,
      "543": 134,
      "422": 135,
      "400": 136,
      "1005": 137,
      "542": 138,
      "760": 139,
      "1012": 140,
      "365": 141,
      "850": 142,
      "476": 143,
      "817": 144,
      "484": 145,
      "156": 146,
      "154": 147,
      "622": 148,
      "951": 149,
      "828": 150,
      "31": 151,
      "214": 152,
      "294": 153,
      "481": 154,
      "856": 155,
      "178": 156,
      "882": 157,
      "685": 158,
      "145": 159,
      "513": 160,
      "682": 161,
      "537": 162,
      "526": 163,
      "980": 164,
      "130": 165,
      "349": 166,
      "792": 167,
      "923": 168,
      "438": 169,
      "368": 170,
      "663": 171,
      "625": 172,
      "366": 173,
      "575": 174,
      "691": 175,
      "429": 176,
      "270": 177,
      "600": 178,
      "391": 179,
      "620": 180,
      "1003": 181,
      "876": 182,
      "607": 183,
      "372": 184,
      "712": 185,
      "855": 186,
      "152": 187,
      "889": 188,
      "187": 189,
      "174": 190,
      "299": 191,
      "551": 192,
      "778": 193,
      "615": 194,
      "240": 195,
      "447": 196,
      "442": 197,
      "996": 198,
      "932": 199,
      "402": 200,
      "219": 201,
      "610": 202,
      "560": 203,
      "885": 204,
      "789": 205,
      "842": 206,
      "974": 207,
      "864": 208,
      "835": 209,
      "228": 210,
      "271": 211,
      "944": 212,
      "748": 213,
      "148": 214,
      "293": 215,
      "558": 216,
      "221": 217,
      "290": 218,
      "113": 219,
      "504": 220,
      "1021": 221,
      "1017": 222,
      "739": 223,
      "80": 224,
      "723": 225,
      "924": 226,
      "865": 227,
      "938": 228,
      "613": 229,
      "582": 230,
      "203": 231,
      "387": 232,
      "979": 233,
      "997": 234,
      "61": 235,
      "180": 236,
      "0": 237,
      "804": 238,
      "603": 239,
      "907": 240,
      "852": 241,
      "172": 242,
      "206": 243,
      "111": 244,
      "331": 245,
      "4": 246,
      "769": 247,
      "1002": 248,
      "814": 249,
      "606": 250,
      "15": 251,
      "866": 252,
      "553": 253,
      "805": 254,
      "25": 255,
      "418": 256,
      "715": 257,
      "609": 258,
      "538": 259,
      "527": 260,
      "687": 261,
      "390": 262,
      "816": 263,
      "592": 264,
      "133": 265,
      "381": 266,
      "737": 267,
      "798": 268,
      "160": 269,
      "480": 270,
      "471": 271,
      "324": 272,
      "977": 273,
      "239": 274,
      "337": 275,
      "173": 276,
      "396": 277,
      "744": 278,
      "740": 279,
      "886": 280,
      "17": 281,
      "162": 282,
      "519": 283,
      "300": 284,
      "565": 285,
      "224": 286,
      "815": 287,
      "139": 288,
      "959": 289,
      "662": 290,
      "443": 291,
      "895": 292,
      "883": 293,
      "482": 294,
      "1020": 295,
      "274": 296,
      "291": 297,
      "118": 298,
      "577": 299,
      "453": 300,
      "287": 301,
      "499": 302,
      "927": 303,
      "681": 304,
      "117": 305,
      "750": 306,
      "910": 307,
      "236": 308,
      "131": 309,
      "547": 310,
      "894": 311,
      "1010": 312,
      "726": 313,
      "960": 314,
      "388": 315,
      "540": 316,
      "971": 317,
      "696": 318,
      "572": 319,
      "171": 320,
      "316": 321,
      "1023": 322,
      "877": 323,
      "761": 324,
      "1004": 325,
      "242": 326,
      "503": 327,
      "514": 328,
      "222": 329,
      "524": 330,
      "323": 331,
      "957": 332,
      "711": 333,
      "627": 334,
      "55": 335,
      "377": 336,
      "69": 337,
      "772": 338,
      "782": 339,
      "833": 340,
      "469": 341,
      "339": 342,
      "452": 343,
      "823": 344,
      "378": 345,
      "699": 346,
      "310": 347,
      "238": 348,
      "585": 349,
      "397": 350,
      "633": 351,
      "199": 352,
      "903": 353,
      "141": 354,
      "496": 355,
      "559": 356,
      "556": 357,
      "74": 358,
      "465": 359,
      "421": 360,
      "988": 361,
      "892": 362,
      "666": 363,
      "272": 364,
      "1011": 365,
      "732": 366,
      "970": 367,
      "781": 368,
      "810": 369,
      "68": 370,
      "165": 371,
      "12": 372,
      "630": 373,
      "569": 374,
      "982": 375,
      "334": 376,
      "38": 377,
      "8": 378,
      "374": 379,
      "64": 380,
      "464": 381,
      "198": 382,
      "690": 383,
      "45": 384,
      "450": 385,
      "478": 386,
      "601": 387,
      "210": 388,
      "260": 389,
      "286": 390,
      "921": 391,
      "608": 392,
      "863": 393,
      "41": 394,
      "522": 395,
      "16": 396,
      "650": 397,
      "281": 398,
      "268": 399,
      "590": 400,
      "191": 401,
      "147": 402,
      "846": 403,
      "557": 404,
      "598": 405,
      "838": 406,
      "302": 407,
      "972": 408,
      "948": 409,
      "629": 410,
      "108": 411,
      "721": 412,
      "733": 413,
      "410": 414,
      "433": 415,
      "1018": 416,
      "14": 417,
      "797": 418,
      "401": 419,
      "908": 420,
      "533": 421,
      "676": 422,
      "579": 423,
      "150": 424,
      "887": 425,
      "983": 426,
      "791": 427,
      "498": 428,
      "926": 429,
      "836": 430,
      "966": 431,
      "840": 432,
      "472": 433,
      "640": 434,
      "591": 435,
      "880": 436,
      "693": 437,
      "968": 438,
      "382": 439,
      "949": 440,
      "703": 441,
      "779": 442,
      "392": 443,
      "618": 444,
      "379": 445,
      "455": 446,
      "529": 447,
      "790": 448,
      "832": 449,
      "520": 450,
      "153": 451,
      "563": 452,
      "802": 453,
      "1008": 454,
      "500": 455,
      "273": 456,
      "296": 457,
      "780": 458,
      "517": 459,
      "371": 460,
      "512": 461,
      "99": 462,
      "604": 463,
      "380": 464,
      "92": 465,
      "39": 466,
      "820": 467,
      "1019": 468,
      "849": 469,
      "257": 470,
      "330": 471,
      "707": 472,
      "486": 473,
      "350": 474,
      "475": 475,
      "665": 476,
      "822": 477,
      "463": 478,
      "1022": 479,
      "346": 480,
      "671": 481,
      "809": 482,
      "112": 483,
      "946": 484,
      "215": 485,
      "407": 486,
      "327": 487,
      "619": 488,
      "896": 489,
      "101": 490,
      "284": 491,
      "708": 492,
      "329": 493,
      "545": 494,
      "252": 495,
      "729": 496,
      "929": 497,
      "116": 498,
      "916": 499,
      "657": 500,
      "941": 501,
      "692": 502,
      "807": 503,
      "351": 504,
      "385": 505,
      "335": 506,
      "491": 507,
      "306": 508,
      "736": 509,
      "719": 510,
      "409": 511,
      "417": 512,
      "467": 513,
      "757": 514,
      "208": 515,
      "231": 516,
      "502": 517,
      "91": 518,
      "413": 519,
      "127": 520,
      "319": 521,
      "698": 522,
      "616": 523,
      "766": 524,
      "621": 525,
      "801": 526,
      "918": 527,
      "639": 528,
      "952": 529,
      "605": 530,
      "827": 531,
      "578": 532,
      "237": 533,
      "42": 534,
      "525": 535,
      "202": 536,
      "647": 537,
      "135": 538,
      "564": 539,
      "893": 540,
      "830": 541,
      "831": 542,
      "149": 543,
      "986": 544,
      "205": 545,
      "597": 546,
      "361": 547,
      "288": 548,
      "534": 549,
      "731": 550,
      "950": 551,
      "717": 552,
      "115": 553,
      "460": 554,
      "700": 555,
      "229": 556,
      "192": 557,
      "57": 558,
      "947": 559,
      "589": 560,
      "373": 561,
      "641": 562,
      "574": 563,
      "276": 564,
      "867": 565,
      "5": 566,
      "839": 567,
      "1007": 568,
      "508": 569,
      "586": 570,
      "684": 571,
      "808": 572,
      "678": 573,
      "857": 574,
      "393": 575,
      "505": 576,
      "1006": 577,
      "434": 578,
      "891": 579,
      "190": 580,
      "138": 581,
      "709": 582,
      "27": 583,
      "546": 584,
      "964": 585,
      "267": 586,
      "197": 587,
      "624": 588,
      "637": 589,
      "73": 590,
      "1016": 591,
      "763": 592,
      "806": 593,
      "675": 594,
      "680": 595,
      "566": 596,
      "181": 597,
      "659": 598,
      "898": 599,
      "795": 600,
      "638": 601,
      "922": 602,
      "958": 603,
      "128": 604,
      "479": 605,
      "23": 606,
      "862": 607,
      "999": 608,
      "672": 609,
      "399": 610,
      "593": 611,
      "395": 612,
      "427": 613,
      "834": 614,
      "928": 615,
      "653": 616,
      "614": 617,
      "742": 618,
      "436": 619,
      "136": 620,
      "122": 621,
      "661": 622,
      "562": 623,
      "994": 624,
      "256": 625,
      "933": 626,
      "161": 627,
      "939": 628,
      "992": 629,
      "738": 630,
      "146": 631,
      "448": 632,
      "102": 633,
      "406": 634,
      "897": 635,
      "728": 636,
      "985": 637,
      "494": 638,
      "411": 639,
      "363": 640,
      "85": 641,
      "539": 642,
      "516": 643,
      "875": 644,
      "752": 645,
      "853": 646,
      "975": 647,
      "531": 648,
      "77": 649,
      "332": 650,
      "695": 651,
      "279": 652,
      "765": 653,
      "837": 654,
      "930": 655,
      "308": 656,
      "969": 657,
      "493": 658,
      "884": 659,
      "255": 660,
      "235": 661,
      "326": 662,
      "100": 663,
      "247": 664,
      "645": 665,
      "352": 666,
      "754": 667,
      "670": 668,
      "860": 669,
      "861": 670,
      "919": 671,
      "163": 672,
      "357": 673,
      "11": 674,
      "648": 675,
      "249": 676,
      "124": 677,
      "459": 678,
      "76": 679,
      "444": 680,
      "548": 681,
      "96": 682,
      "336": 683,
      "292": 684,
      "773": 685,
      "345": 686,
      "730": 687,
      "432": 688,
      "705": 689,
      "468": 690,
      "244": 691,
      "940": 692,
      "521": 693,
      "367": 694,
      "937": 695,
      "439": 696,
      "767": 697,
      "724": 698,
      "611": 699,
      "137": 700,
      "285": 701,
      "784": 702,
      "312": 703,
      "188": 704,
      "571": 705,
      "844": 706,
      "398": 707,
      "95": 708,
      "320": 709,
      "211": 710,
      "1009": 711,
      "935": 712,
      "528": 713,
      "710": 714,
      "890": 715,
      "303": 716,
      "414": 717,
      "872": 718,
      "936": 719,
      "297": 720,
      "914": 721,
      "931": 722,
      "655": 723,
      "313": 724,
      "813": 725,
      "359": 726,
      "567": 727,
      "706": 728,
      "121": 729,
      "741": 730,
      "510": 731,
      "360": 732,
      "168": 733,
      "981": 734,
      "753": 735,
      "254": 736,
      "636": 737,
      "658": 738,
      "53": 739,
      "301": 740,
      "587": 741,
      "688": 742,
      "803": 743,
      "48": 744,
      "847": 745,
      "415": 746,
      "125": 747,
      "900": 748,
      "425": 749,
      "488": 750,
      "358": 751,
      "2": 752,
      "333": 753,
      "403": 754,
      "689": 755,
      "965": 756,
      "200": 757,
      "466": 758,
      "535": 759,
      "501": 760,
      "642": 761,
      "799": 762,
      "364": 763,
      "993": 764,
      "549": 765,
      "416": 766,
      "232": 767,
      "19": 768,
      "776": 769,
      "408": 770,
      "673": 771,
      "182": 772,
      "423": 773,
      "515": 774,
      "942": 775,
      "701": 776,
      "343": 777,
      "677": 778,
      "50": 779,
      "348": 780,
      "269": 781,
      "7": 782,
      "793": 783,
      "530": 784,
      "376": 785,
      "915": 786,
      "716": 787,
      "473": 788,
      "258": 789,
      "826": 790,
      "570": 791,
      "419": 792,
      "328": 793,
      "280": 794,
      "674": 795,
      "777": 796,
      "262": 797,
      "523": 798,
      "859": 799,
      "354": 800,
      "967": 801,
      "218": 802,
      "81": 803,
      "686": 804,
      "913": 805,
      "888": 806,
      "783": 807,
      "89": 808,
      "660": 809,
      "183": 810,
      "78": 811,
      "497": 812,
      "762": 813,
      "909": 814,
      "485": 815,
      "920": 816,
      "718": 817,
      "905": 818,
      "848": 819,
      "552": 820,
      "953": 821,
      "369": 822,
      "440": 823,
      "107": 824,
      "355": 825,
      "309": 826,
      "976": 827,
      "583": 828,
      "424": 829,
      "870": 830,
      "340": 831,
      "437": 832,
      "170": 833,
      "651": 834,
      "134": 835,
      "751": 836,
      "194": 837,
      "56": 838,
      "36": 839,
      "389": 840,
      "441": 841,
      "714": 842,
      "904": 843,
      "298": 844,
      "759": 845,
      "588": 846,
      "643": 847,
      "175": 848,
      "825": 849,
      "646": 850,
      "454": 851,
      "233": 852,
      "226": 853,
      "713": 854,
      "155": 855,
      "404": 856,
      "283": 857,
      "554": 858,
      "755": 859,
      "426": 860,
      "550": 861,
      "871": 862,
      "83": 863,
      "220": 864,
      "250": 865,
      "261": 866,
      "555": 867,
      "1001": 868,
      "71": 869,
      "917": 870,
      "58": 871,
      "487": 872,
      "869": 873,
      "720": 874,
      "230": 875,
      "338": 876,
      "573": 877,
      "21": 878,
      "635": 879,
      "943": 880,
      "123": 881,
      "774": 882,
      "854": 883,
      "722": 884,
      "431": 885,
      "749": 886,
      "412": 887,
      "88": 888,
      "28": 889,
      "667": 890,
      "40": 891,
      "679": 892,
      "264": 893,
      "63": 894,
      "973": 895,
      "879": 896,
      "193": 897,
      "595": 898,
      "745": 899,
      "445": 900,
      "998": 901,
      "945": 902,
      "362": 903,
      "775": 904,
      "580": 905,
      "991": 906,
      "901": 907,
      "843": 908,
      "697": 909,
      "167": 910,
      "954": 911,
      "375": 912,
      "800": 913,
      "812": 914,
      "384": 915,
      "51": 916,
      "612": 917,
      "841": 918,
      "492": 919,
      "428": 920,
      "462": 921,
      "631": 922,
      "282": 923,
      "602": 924,
      "119": 925,
      "43": 926,
      "49": 927,
      "1000": 928,
      "201": 929,
      "902": 930,
      "735": 931,
      "458": 932,
      "995": 933,
      "644": 934,
      "342": 935,
      "819": 936,
      "344": 937,
      "489": 938,
      "1013": 939,
      "143": 940
    },
    "unk_token": "<unk>"
  }
}