{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "317": 0,
      "204": 1,
      "103": 2,
      "851": 3,
      "734": 4,
      "925": 5,
      "246": 6,
      "307": 7,
      "394": 8,
      "405": 9,
      "253": 10,
      "179": 11,
      "899": 12,
      "743": 13,
      "984": 14,
      "227": 15,
      "189": 16,
      "305": 17,
      "911": 18,
      "457": 19,
      "664": 20,
      "881": 21,
      "353": 22,
      "225": 23,
      "461": 24,
      "159": 25,
      "632": 26,
      "289": 27,
      "275": 28,
      "370": 29,
      "451": 30,
      "628": 31,
      "656": 32,
      "796": 33,
      "725": 34,
      "544": 35,
      "785": 36,
      "176": 37,
      "758": 38,
      "477": 39,
      "787": 40,
      "771": 41,
      "1015": 42,
      "435": 43,
      "446": 44,
      "824": 45,
      "747": 46,
      "561": 47,
      "213": 48,
      "990": 49,
      "311": 50,
      "963": 51,
      "858": 52,
      "420": 53,
      "868": 54,
      "511": 55,
      "694": 56,
      "568": 57,
      "47": 58,
      "114": 59,
      "70": 60,
      "243": 61,
      "634": 62,
      "961": 63,
      "873": 64,
      "746": 65,
      "322": 66,
      "164": 67,
      "1014": 68,
      "955": 69,
      "490": 70,
      "13": 71,
      "874": 72,
      "185": 73,
      "756": 74,
      "209": 75,
      "596": 76,
      "584": 77,
      "18": 78,
      "110": 79,
      "669": 80,
      "44": 81,
      "652": 82,
      "217": 83,
      "383": 84,
      "315": 85,
      "65": 86,
      "956": 87,
      "6": 88,
      "277": 89,
      "934": 90,
      "265": 91,
      "654": 92,
      "157": 93,
      "234": 94,
      "594": 95,
      "93": 96,
      "386": 97,
      "506": 98,
      "536": 99,
      "786": 100,
      "248": 101,
      "581": 102,
      "845": 103,
      "576": 104,
      "704": 105,
      "770": 106,
      "668": 107,
      "821": 108,
      "509": 109,
      "495": 110,
      "223": 111,
      "683": 112,
      "906": 113,
      "989": 114,
      "962": 115,
      "430": 116,
      "59": 117,
      "987": 118,
      "474": 119,
      "878": 120,
      "702": 121,
      "764": 122,
      "617": 123,
      "727": 124,
      "142": 125,
      "818": 126,
      "788": 127,
      "166": 128,
      "768": 129,
      "456": 130,
      "507": 131,
      "26": 132,
      "649": 133,
      "470": 134,
      "626": 135,
      "541": 136,
      "978": 137,
      "449": 138,
      "22": 139,
      "912": 140,
      "829": 141,
      "356": 142,
      "1005": 143,
      "422": 144,
      "400": 145,
      "543": 146,
      "542": 147,
      "760": 148,
      "1012": 149,
      "365": 150,
      "850": 151,
      "817": 152,
      "154": 153,
      "484": 154,
      "106": 155,
      "476": 156,
      "622": 157,
      "951": 158,
      "828": 159,
      "156": 160,
      "31": 161,
      "318": 162,
      "294": 163,
      "214": 164,
      "481": 165,
      "856": 166,
      "178": 167,
      "882": 168,
      "72": 169,
      "145": 170,
      "685": 171,
      "513": 172,
      "682": 173,
      "537": 174,
      "526": 175,
      "980": 176,
      "130": 177,
      "923": 178,
      "792": 179,
      "349": 180,
      "366": 181,
      "368": 182,
      "625": 183,
      "438": 184,
      "663": 185,
      "575": 186,
      "691": 187,
      "429": 188,
      "270": 189,
      "600": 190,
      "620": 191,
      "391": 192,
      "1003": 193,
      "876": 194,
      "712": 195,
      "889": 196,
      "372": 197,
      "855": 198,
      "152": 199,
      "607": 200,
      "187": 201,
      "174": 202,
      "299": 203,
      "615": 204,
      "778": 205,
      "551": 206,
      "240": 207,
      "447": 208,
      "442": 209,
      "996": 210,
      "932": 211,
      "402": 212,
      "219": 213,
      "610": 214,
      "885": 215,
      "560": 216,
      "789": 217,
      "842": 218,
      "974": 219,
      "864": 220,
      "177": 221,
      "835": 222,
      "33": 223,
      "271": 224,
      "228": 225,
      "944": 226,
      "748": 227,
      "148": 228,
      "293": 229,
      "98": 230,
      "558": 231,
      "221": 232,
      "290": 233,
      "504": 234,
      "113": 235,
      "1021": 236,
      "739": 237,
      "1017": 238,
      "94": 239,
      "80": 240,
      "723": 241,
      "924": 242,
      "865": 243,
      "938": 244,
      "140": 245,
      "613": 246,
      "582": 247,
      "203": 248,
      "387": 249,
      "979": 250,
      "997": 251,
      "61": 252,
      "603": 253,
      "804": 254,
      "180": 255,
      "0": 256,
      "852": 257,
      "907": 258,
      "172": 259,
      "206": 260,
      "111": 261,
      "4": 262,
      "331": 263,
      "86": 264,
      "769": 265,
      "814": 266,
      "1002": 267,
      "606": 268,
      "15": 269,
      "866": 270,
      "805": 271,
      "553": 272,
      "25": 273,
      "418": 274,
      "715": 275,
      "609": 276,
      "538": 277,
      "527": 278,
      "816": 279,
      "390": 280,
      "687": 281,
      "592": 282,
      "381": 283,
      "133": 284,
      "737": 285,
      "767": 286,
      "798": 287,
      "160": 288,
      "480": 289,
      "471": 290,
      "324": 291,
      "337": 292,
      "239": 293,
      "977": 294,
      "173": 295,
      "396": 296,
      "744": 297,
      "740": 298,
      "886": 299,
      "162": 300,
      "519": 301,
      "300": 302,
      "565": 303,
      "224": 304,
      "815": 305,
      "139": 306,
      "959": 307,
      "662": 308,
      "443": 309,
      "97": 310,
      "895": 311,
      "883": 312,
      "482": 313,
      "1020": 314,
      "274": 315,
      "291": 316,
      "118": 317,
      "577": 318,
      "259": 319,
      "453": 320,
      "287": 321,
      "499": 322,
      "927": 323,
      "79": 324,
      "681": 325,
      "117": 326,
      "66": 327,
      "750": 328,
      "910": 329,
      "236": 330,
      "131": 331,
      "547": 332,
      "1010": 333,
      "894": 334,
      "726": 335,
      "960": 336,
      "971": 337,
      "388": 338,
      "540": 339,
      "572": 340,
      "696": 341,
      "171": 342,
      "316": 343,
      "1023": 344,
      "761": 345,
      "877": 346,
      "1004": 347,
      "242": 348,
      "503": 349,
      "514": 350,
      "222": 351,
      "524": 352,
      "323": 353,
      "957": 354,
      "711": 355,
      "627": 356,
      "55": 357,
      "377": 358,
      "69": 359,
      "772": 360,
      "782": 361,
      "833": 362,
      "339": 363,
      "469": 364,
      "452": 365,
      "823": 366,
      "378": 367,
      "699": 368,
      "310": 369,
      "238": 370,
      "120": 371,
      "397": 372,
      "199": 373,
      "585": 374,
      "633": 375,
      "903": 376,
      "141": 377,
      "496": 378,
      "559": 379,
      "556": 380,
      "465": 381,
      "421": 382,
      "988": 383,
      "892": 384,
      "666": 385,
      "272": 386,
      "1011": 387,
      "732": 388,
      "970": 389,
      "781": 390,
      "810": 391,
      "68": 392,
      "186": 393,
      "165": 394,
      "12": 395,
      "3": 396,
      "630": 397,
      "569": 398,
      "982": 399,
      "263": 400,
      "334": 401,
      "8": 402,
      "104": 403,
      "374": 404,
      "64": 405,
      "464": 406,
      "198": 407,
      "690": 408,
      "45": 409,
      "450": 410,
      "478": 411,
      "601": 412,
      "210": 413,
      "260": 414,
      "921": 415,
      "286": 416,
      "608": 417,
      "863": 418,
      "41": 419,
      "522": 420,
      "16": 421,
      "650": 422,
      "268": 423,
      "281": 424,
      "590": 425,
      "191": 426,
      "147": 427,
      "557": 428,
      "846": 429,
      "302": 430,
      "598": 431,
      "144": 432,
      "972": 433,
      "948": 434,
      "838": 435,
      "629": 436,
      "108": 437,
      "721": 438,
      "733": 439,
      "433": 440,
      "410": 441,
      "1018": 442,
      "797": 443,
      "401": 444,
      "908": 445,
      "533": 446,
      "676": 447,
      "87": 448,
      "811": 449,
      "158": 450,
      "150": 451,
      "887": 452,
      "983": 453,
      "791": 454,
      "498": 455,
      "926": 456,
      "836": 457,
      "966": 458,
      "640": 459,
      "840": 460,
      "472": 461,
      "591": 462,
      "880": 463,
      "693": 464,
      "968": 465,
      "382": 466,
      "703": 467,
      "949": 468,
      "779": 469,
      "392": 470,
      "618": 471,
      "379": 472,
      "455": 473,
      "529": 474,
      "790": 475,
      "832": 476,
      "520": 477,
      "563": 478,
      "802": 479,
      "1008": 480,
      "623": 481,
      "500": 482,
      "169": 483,
      "273": 484,
      "296": 485,
      "780": 486,
      "512": 487,
      "517": 488,
      "371": 489,
      "99": 490,
      "604": 491,
      "380": 492,
      "92": 493,
      "39": 494,
      "820": 495,
      "849": 496,
      "1019": 497,
      "257": 498,
      "330": 499,
      "707": 500,
      "486": 501,
      "350": 502,
      "665": 503,
      "475": 504,
      "822": 505,
      "463": 506,
      "1022": 507,
      "346": 508,
      "671": 509,
      "724": 510,
      "212": 511,
      "809": 512,
      "112": 513,
      "946": 514,
      "215": 515,
      "407": 516,
      "327": 517,
      "619": 518,
      "896": 519,
      "101": 520,
      "284": 521,
      "708": 522,
      "329": 523,
      "545": 524,
      "90": 525,
      "929": 526,
      "116": 527,
      "729": 528,
      "916": 529,
      "252": 530,
      "657": 531,
      "941": 532,
      "692": 533,
      "251": 534,
      "807": 535,
      "385": 536,
      "351": 537,
      "196": 538,
      "335": 539,
      "491": 540,
      "306": 541,
      "719": 542,
      "409": 543,
      "736": 544,
      "417": 545,
      "467": 546,
      "757": 547,
      "208": 548,
      "231": 549,
      "502": 550,
      "91": 551,
      "413": 552,
      "127": 553,
      "319": 554,
      "698": 555,
      "616": 556,
      "766": 557,
      "621": 558,
      "801": 559,
      "918": 560,
      "639": 561,
      "827": 562,
      "605": 563,
      "952": 564,
      "532": 565,
      "578": 566,
      "216": 567,
      "237": 568,
      "42": 569,
      "202": 570,
      "525": 571,
      "647": 572,
      "564": 573,
      "135": 574,
      "893": 575,
      "830": 576,
      "831": 577,
      "149": 578,
      "986": 579,
      "205": 580,
      "597": 581,
      "361": 582,
      "84": 583,
      "288": 584,
      "534": 585,
      "731": 586,
      "950": 587,
      "717": 588,
      "115": 589,
      "460": 590,
      "700": 591,
      "229": 592,
      "192": 593,
      "57": 594,
      "947": 595,
      "589": 596,
      "373": 597,
      "641": 598,
      "341": 599,
      "10": 600,
      "574": 601,
      "276": 602,
      "794": 603,
      "867": 604,
      "5": 605,
      "839": 606,
      "508": 607,
      "1007": 608,
      "684": 609,
      "586": 610,
      "808": 611,
      "678": 612,
      "857": 613,
      "505": 614,
      "393": 615,
      "1006": 616,
      "434": 617,
      "891": 618,
      "190": 619,
      "138": 620,
      "709": 621,
      "27": 622,
      "546": 623,
      "964": 624,
      "267": 625,
      "197": 626,
      "624": 627,
      "637": 628,
      "73": 629,
      "1016": 630,
      "763": 631,
      "806": 632,
      "675": 633,
      "680": 634,
      "566": 635,
      "181": 636,
      "659": 637,
      "898": 638,
      "60": 639,
      "638": 640,
      "795": 641,
      "922": 642,
      "958": 643,
      "479": 644,
      "23": 645,
      "128": 646,
      "862": 647,
      "399": 648,
      "999": 649,
      "672": 650,
      "593": 651,
      "395": 652,
      "427": 653,
      "834": 654,
      "928": 655,
      "653": 656,
      "614": 657,
      "742": 658,
      "436": 659,
      "122": 660,
      "136": 661,
      "661": 662,
      "562": 663,
      "256": 664,
      "994": 665,
      "933": 666,
      "151": 667,
      "161": 668,
      "406": 669,
      "992": 670,
      "146": 671,
      "738": 672,
      "102": 673,
      "448": 674,
      "939": 675,
      "494": 676,
      "985": 677,
      "728": 678,
      "897": 679,
      "411": 680,
      "363": 681,
      "85": 682,
      "539": 683,
      "752": 684,
      "875": 685,
      "516": 686,
      "853": 687,
      "975": 688,
      "531": 689,
      "77": 690,
      "332": 691,
      "279": 692,
      "765": 693,
      "132": 694,
      "837": 695,
      "35": 696,
      "930": 697,
      "308": 698,
      "969": 699,
      "493": 700,
      "884": 701,
      "255": 702,
      "235": 703,
      "326": 704,
      "100": 705,
      "247": 706,
      "352": 707,
      "645": 708,
      "24": 709,
      "670": 710,
      "860": 711,
      "861": 712,
      "919": 713,
      "754": 714,
      "163": 715,
      "357": 716,
      "11": 717,
      "648": 718,
      "249": 719,
      "124": 720,
      "459": 721,
      "20": 722,
      "76": 723,
      "444": 724,
      "245": 725,
      "548": 726,
      "96": 727,
      "336": 728,
      "292": 729,
      "773": 730,
      "345": 731,
      "67": 732,
      "730": 733,
      "705": 734,
      "432": 735,
      "468": 736,
      "244": 737,
      "521": 738,
      "940": 739,
      "37": 740,
      "367": 741,
      "195": 742,
      "153": 743,
      "784": 744,
      "137": 745,
      "937": 746,
      "611": 747,
      "285": 748,
      "439": 749,
      "95": 750,
      "398": 751,
      "312": 752,
      "571": 753,
      "844": 754,
      "188": 755,
      "211": 756,
      "320": 757,
      "1009": 758,
      "935": 759,
      "528": 760,
      "710": 761,
      "890": 762,
      "303": 763,
      "414": 764,
      "914": 765,
      "297": 766,
      "872": 767,
      "936": 768,
      "931": 769,
      "655": 770,
      "813": 771,
      "313": 772,
      "567": 773,
      "706": 774,
      "359": 775,
      "121": 776,
      "741": 777,
      "510": 778,
      "347": 779,
      "360": 780,
      "168": 781,
      "981": 782,
      "753": 783,
      "254": 784,
      "636": 785,
      "54": 786,
      "658": 787,
      "53": 788,
      "301": 789,
      "599": 790,
      "587": 791,
      "688": 792,
      "803": 793,
      "48": 794,
      "847": 795,
      "62": 796,
      "304": 797,
      "125": 798,
      "415": 799,
      "900": 800,
      "425": 801,
      "358": 802,
      "2": 803,
      "333": 804,
      "278": 805,
      "403": 806,
      "689": 807,
      "965": 808,
      "30": 809,
      "535": 810,
      "466": 811,
      "501": 812,
      "200": 813,
      "46": 814,
      "799": 815,
      "364": 816,
      "993": 817,
      "549": 818,
      "416": 819,
      "19": 820,
      "232": 821,
      "673": 822,
      "408": 823,
      "776": 824,
      "182": 825,
      "515": 826,
      "423": 827,
      "314": 828,
      "942": 829,
      "701": 830,
      "343": 831,
      "50": 832,
      "348": 833,
      "269": 834,
      "7": 835,
      "266": 836,
      "793": 837,
      "530": 838,
      "376": 839,
      "915": 840,
      "473": 841,
      "258": 842,
      "826": 843,
      "570": 844,
      "419": 845,
      "328": 846,
      "674": 847,
      "280": 848,
      "777": 849,
      "262": 850,
      "523": 851,
      "859": 852,
      "354": 853,
      "184": 854,
      "967": 855,
      "218": 856,
      "686": 857,
      "913": 858,
      "888": 859,
      "783": 860,
      "89": 861,
      "660": 862,
      "183": 863,
      "78": 864,
      "762": 865,
      "497": 866,
      "909": 867,
      "485": 868,
      "920": 869,
      "718": 870,
      "905": 871,
      "848": 872,
      "552": 873,
      "953": 874,
      "440": 875,
      "369": 876,
      "107": 877,
      "355": 878,
      "309": 879,
      "976": 880,
      "34": 881,
      "583": 882,
      "424": 883,
      "870": 884,
      "340": 885,
      "437": 886,
      "170": 887,
      "651": 888,
      "134": 889,
      "751": 890,
      "389": 891,
      "194": 892,
      "298": 893,
      "714": 894,
      "441": 895,
      "759": 896,
      "56": 897,
      "36": 898,
      "904": 899,
      "588": 900,
      "295": 901,
      "643": 902,
      "175": 903,
      "825": 904,
      "646": 905,
      "454": 906,
      "233": 907,
      "226": 908,
      "713": 909,
      "155": 910,
      "404": 911,
      "283": 912,
      "554": 913,
      "755": 914,
      "426": 915,
      "871": 916,
      "261": 917,
      "550": 918,
      "555": 919,
      "250": 920,
      "83": 921,
      "220": 922,
      "1001": 923,
      "917": 924,
      "58": 925,
      "487": 926,
      "720": 927,
      "869": 928,
      "230": 929,
      "21": 930,
      "338": 931,
      "325": 932,
      "635": 933,
      "483": 934,
      "943": 935,
      "573": 936,
      "123": 937,
      "774": 938,
      "854": 939,
      "722": 940,
      "9": 941,
      "412": 942,
      "431": 943,
      "88": 944,
      "28": 945,
      "105": 946,
      "40": 947,
      "667": 948,
      "679": 949,
      "264": 950,
      "973": 951,
      "63": 952,
      "193": 953,
      "595": 954,
      "745": 955,
      "445": 956,
      "998": 957,
      "362": 958,
      "945": 959,
      "580": 960,
      "775": 961,
      "991": 962,
      "901": 963,
      "843": 964,
      "697": 965,
      "375": 966,
      "954": 967,
      "800": 968,
      "241": 969,
      "167": 970,
      "812": 971,
      "384": 972,
      "51": 973,
      "612": 974,
      "841": 975,
      "492": 976,
      "462": 977,
      "631": 978,
      "282": 979,
      "207": 980,
      "602": 981,
      "321": 982,
      "43": 983,
      "49": 984,
      "1000": 985,
      "201": 986,
      "735": 987,
      "902": 988,
      "995": 989,
      "458": 990,
      "644": 991,
      "342": 992,
      "819": 993,
      "344": 994,
      "489": 995,
      "1013": 996,
      "143": 997
    },
    "unk_token": "<unk>"
  }
}