{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "317": 0,
      "204": 1,
      "103": 2,
      "246": 3,
      "925": 4,
      "734": 5,
      "851": 6,
      "307": 7,
      "394": 8,
      "405": 9,
      "253": 10,
      "899": 11,
      "984": 12,
      "743": 13,
      "227": 14,
      "189": 15,
      "305": 16,
      "457": 17,
      "911": 18,
      "664": 19,
      "881": 20,
      "353": 21,
      "225": 22,
      "461": 23,
      "159": 24,
      "632": 25,
      "289": 26,
      "275": 27,
      "370": 28,
      "451": 29,
      "628": 30,
      "656": 31,
      "796": 32,
      "544": 33,
      "725": 34,
      "785": 35,
      "176": 36,
      "758": 37,
      "477": 38,
      "787": 39,
      "771": 40,
      "1015": 41,
      "435": 42,
      "446": 43,
      "824": 44,
      "747": 45,
      "561": 46,
      "213": 47,
      "990": 48,
      "311": 49,
      "963": 50,
      "858": 51,
      "420": 52,
      "961": 53,
      "868": 54,
      "694": 55,
      "511": 56,
      "70": 57,
      "47": 58,
      "114": 59,
      "243": 60,
      "634": 61,
      "568": 62,
      "873": 63,
      "746": 64,
      "322": 65,
      "164": 66,
      "1014": 67,
      "490": 68,
      "13": 69,
      "874": 70,
      "185": 71,
      "756": 72,
      "209": 73,
      "596": 74,
      "584": 75,
      "18": 76,
      "110": 77,
      "669": 78,
      "44": 79,
      "652": 80,
      "383": 81,
      "315": 82,
      "65": 83,
      "6": 84,
      "277": 85,
      "934": 86,
      "265": 87,
      "654": 88,
      "157": 89,
      "234": 90,
      "594": 91,
      "93": 92,
      "386": 93,
      "770": 94,
      "536": 95,
      "845": 96,
      "581": 97,
      "506": 98,
      "786": 99,
      "576": 100,
      "704": 101,
      "248": 102,
      "668": 103,
      "821": 104,
      "509": 105,
      "495": 106,
      "223": 107,
      "683": 108,
      "989": 109,
      "962": 110,
      "59": 111,
      "878": 112,
      "430": 113,
      "474": 114,
      "987": 115,
      "29": 116,
      "702": 117,
      "764": 118,
      "518": 119,
      "727": 120,
      "617": 121,
      "142": 122,
      "818": 123,
      "788": 124,
      "166": 125,
      "768": 126,
      "456": 127,
      "507": 128,
      "541": 129,
      "649": 130,
      "470": 131,
      "626": 132,
      "26": 133,
      "978": 134,
      "449": 135,
      "22": 136,
      "912": 137,
      "356": 138,
      "829": 139,
      "543": 140,
      "422": 141,
      "400": 142,
      "1005": 143,
      "542": 144,
      "760": 145,
      "1012": 146,
      "850": 147,
      "365": 148,
      "476": 149,
      "817": 150,
      "106": 151,
      "156": 152,
      "484": 153,
      "154": 154,
      "951": 155,
      "828": 156,
      "622": 157,
      "31": 158,
      "318": 159,
      "294": 160,
      "214": 161,
      "481": 162,
      "856": 163,
      "145": 164,
      "882": 165,
      "685": 166,
      "72": 167,
      "178": 168,
      "513": 169,
      "682": 170,
      "537": 171,
      "526": 172,
      "980": 173,
      "438": 174,
      "130": 175,
      "792": 176,
      "366": 177,
      "663": 178,
      "625": 179,
      "368": 180,
      "923": 181,
      "349": 182,
      "575": 183,
      "691": 184,
      "429": 185,
      "270": 186,
      "600": 187,
      "620": 188,
      "391": 189,
      "607": 190,
      "876": 191,
      "712": 192,
      "372": 193,
      "889": 194,
      "1003": 195,
      "152": 196,
      "855": 197,
      "187": 198,
      "174": 199,
      "299": 200,
      "551": 201,
      "615": 202,
      "778": 203,
      "240": 204,
      "447": 205,
      "442": 206,
      "932": 207,
      "219": 208,
      "402": 209,
      "610": 210,
      "885": 211,
      "560": 212,
      "789": 213,
      "177": 214,
      "842": 215,
      "864": 216,
      "974": 217,
      "835": 218,
      "33": 219,
      "271": 220,
      "228": 221,
      "748": 222,
      "944": 223,
      "148": 224,
      "293": 225,
      "98": 226,
      "558": 227,
      "221": 228,
      "290": 229,
      "504": 230,
      "113": 231,
      "1021": 232,
      "739": 233,
      "1017": 234,
      "94": 235,
      "80": 236,
      "924": 237,
      "723": 238,
      "865": 239,
      "938": 240,
      "140": 241,
      "613": 242,
      "582": 243,
      "203": 244,
      "387": 245,
      "979": 246,
      "997": 247,
      "61": 248,
      "804": 249,
      "907": 250,
      "603": 251,
      "180": 252,
      "0": 253,
      "172": 254,
      "206": 255,
      "111": 256,
      "331": 257,
      "4": 258,
      "769": 259,
      "1002": 260,
      "814": 261,
      "606": 262,
      "15": 263,
      "805": 264,
      "553": 265,
      "25": 266,
      "866": 267,
      "418": 268,
      "715": 269,
      "609": 270,
      "538": 271,
      "527": 272,
      "687": 273,
      "390": 274,
      "816": 275,
      "381": 276,
      "133": 277,
      "737": 278,
      "798": 279,
      "160": 280,
      "480": 281,
      "471": 282,
      "324": 283,
      "32": 284,
      "977": 285,
      "337": 286,
      "239": 287,
      "173": 288,
      "396": 289,
      "744": 290,
      "740": 291,
      "886": 292,
      "17": 293,
      "162": 294,
      "519": 295,
      "300": 296,
      "565": 297,
      "815": 298,
      "224": 299,
      "139": 300,
      "959": 301,
      "443": 302,
      "97": 303,
      "895": 304,
      "482": 305,
      "1020": 306,
      "274": 307,
      "291": 308,
      "118": 309,
      "259": 310,
      "577": 311,
      "453": 312,
      "287": 313,
      "499": 314,
      "927": 315,
      "681": 316,
      "79": 317,
      "117": 318,
      "66": 319,
      "750": 320,
      "910": 321,
      "236": 322,
      "131": 323,
      "547": 324,
      "1010": 325,
      "894": 326,
      "726": 327,
      "960": 328,
      "388": 329,
      "540": 330,
      "971": 331,
      "696": 332,
      "572": 333,
      "171": 334,
      "316": 335,
      "1023": 336,
      "877": 337,
      "761": 338,
      "1004": 339,
      "242": 340,
      "503": 341,
      "514": 342,
      "222": 343,
      "524": 344,
      "323": 345,
      "957": 346,
      "711": 347,
      "627": 348,
      "377": 349,
      "55": 350,
      "69": 351,
      "772": 352,
      "833": 353,
      "378": 354,
      "339": 355,
      "452": 356,
      "823": 357,
      "469": 358,
      "699": 359,
      "310": 360,
      "238": 361,
      "585": 362,
      "397": 363,
      "633": 364,
      "199": 365,
      "903": 366,
      "496": 367,
      "559": 368,
      "556": 369,
      "74": 370,
      "465": 371,
      "421": 372,
      "988": 373,
      "892": 374,
      "666": 375,
      "272": 376,
      "1011": 377,
      "732": 378,
      "970": 379,
      "781": 380,
      "810": 381,
      "68": 382,
      "186": 383,
      "165": 384,
      "12": 385,
      "3": 386,
      "630": 387,
      "569": 388,
      "982": 389,
      "263": 390,
      "38": 391,
      "334": 392,
      "8": 393,
      "104": 394,
      "374": 395,
      "64": 396,
      "198": 397,
      "464": 398,
      "690": 399,
      "45": 400,
      "75": 401,
      "601": 402,
      "450": 403,
      "478": 404,
      "286": 405,
      "260": 406,
      "921": 407,
      "210": 408,
      "608": 409,
      "863": 410,
      "41": 411,
      "522": 412,
      "268": 413,
      "650": 414,
      "16": 415,
      "281": 416,
      "590": 417,
      "147": 418,
      "846": 419,
      "191": 420,
      "557": 421,
      "302": 422,
      "838": 423,
      "598": 424,
      "144": 425,
      "972": 426,
      "948": 427,
      "629": 428,
      "108": 429,
      "721": 430,
      "733": 431,
      "410": 432,
      "433": 433,
      "1018": 434,
      "797": 435,
      "401": 436,
      "908": 437,
      "533": 438,
      "676": 439,
      "811": 440,
      "579": 441,
      "158": 442,
      "150": 443,
      "887": 444,
      "983": 445,
      "791": 446,
      "498": 447,
      "836": 448,
      "640": 449,
      "840": 450,
      "472": 451,
      "966": 452,
      "591": 453,
      "880": 454,
      "693": 455,
      "968": 456,
      "382": 457,
      "949": 458,
      "703": 459,
      "82": 460,
      "779": 461,
      "392": 462,
      "618": 463,
      "379": 464,
      "52": 465,
      "455": 466,
      "529": 467,
      "790": 468,
      "520": 469,
      "832": 470,
      "153": 471,
      "563": 472,
      "802": 473,
      "1008": 474,
      "500": 475,
      "623": 476,
      "169": 477,
      "273": 478,
      "296": 479,
      "780": 480,
      "371": 481,
      "517": 482,
      "512": 483,
      "99": 484,
      "604": 485,
      "380": 486,
      "92": 487,
      "39": 488,
      "820": 489,
      "1019": 490,
      "849": 491,
      "257": 492,
      "330": 493,
      "707": 494,
      "486": 495,
      "350": 496,
      "475": 497,
      "665": 498,
      "822": 499,
      "463": 500,
      "1022": 501,
      "346": 502,
      "671": 503,
      "212": 504,
      "809": 505,
      "112": 506,
      "946": 507,
      "215": 508,
      "407": 509,
      "327": 510,
      "619": 511,
      "896": 512,
      "101": 513,
      "284": 514,
      "708": 515,
      "329": 516,
      "545": 517,
      "90": 518,
      "252": 519,
      "116": 520,
      "929": 521,
      "729": 522,
      "916": 523,
      "657": 524,
      "941": 525,
      "251": 526,
      "692": 527,
      "807": 528,
      "351": 529,
      "385": 530,
      "196": 531,
      "335": 532,
      "491": 533,
      "306": 534,
      "736": 535,
      "719": 536,
      "409": 537,
      "417": 538,
      "467": 539,
      "757": 540,
      "208": 541,
      "231": 542,
      "502": 543,
      "413": 544,
      "91": 545,
      "127": 546,
      "319": 547,
      "698": 548,
      "616": 549,
      "766": 550,
      "621": 551,
      "918": 552,
      "639": 553,
      "605": 554,
      "827": 555,
      "952": 556,
      "532": 557,
      "578": 558,
      "216": 559,
      "237": 560,
      "202": 561,
      "525": 562,
      "42": 563,
      "647": 564,
      "135": 565,
      "564": 566,
      "893": 567,
      "830": 568,
      "831": 569,
      "149": 570,
      "986": 571,
      "205": 572,
      "597": 573,
      "361": 574,
      "288": 575,
      "534": 576,
      "731": 577,
      "950": 578,
      "717": 579,
      "115": 580,
      "460": 581,
      "700": 582,
      "192": 583,
      "57": 584,
      "947": 585,
      "589": 586,
      "341": 587,
      "641": 588,
      "373": 589,
      "10": 590,
      "574": 591,
      "276": 592,
      "794": 593,
      "867": 594,
      "5": 595,
      "839": 596,
      "1007": 597,
      "508": 598,
      "586": 599,
      "684": 600,
      "808": 601,
      "678": 602,
      "857": 603,
      "393": 604,
      "505": 605,
      "1006": 606,
      "434": 607,
      "891": 608,
      "190": 609,
      "1": 610,
      "138": 611,
      "709": 612,
      "27": 613,
      "546": 614,
      "964": 615,
      "267": 616,
      "197": 617,
      "624": 618,
      "637": 619,
      "1016": 620,
      "763": 621,
      "806": 622,
      "675": 623,
      "680": 624,
      "566": 625,
      "181": 626,
      "659": 627,
      "898": 628,
      "60": 629,
      "638": 630,
      "862": 631,
      "922": 632,
      "795": 633,
      "479": 634,
      "958": 635,
      "23": 636,
      "128": 637,
      "999": 638,
      "399": 639,
      "593": 640,
      "672": 641,
      "395": 642,
      "427": 643,
      "834": 644,
      "928": 645,
      "653": 646,
      "614": 647,
      "742": 648,
      "436": 649,
      "136": 650,
      "122": 651,
      "562": 652,
      "994": 653,
      "256": 654,
      "933": 655,
      "151": 656,
      "161": 657,
      "939": 658,
      "406": 659,
      "146": 660,
      "992": 661,
      "102": 662,
      "738": 663,
      "448": 664,
      "897": 665,
      "494": 666,
      "985": 667,
      "728": 668,
      "411": 669,
      "363": 670,
      "85": 671,
      "539": 672,
      "875": 673,
      "752": 674,
      "516": 675,
      "853": 676,
      "975": 677,
      "531": 678,
      "77": 679,
      "332": 680,
      "695": 681,
      "279": 682,
      "765": 683,
      "132": 684,
      "837": 685,
      "35": 686,
      "930": 687,
      "308": 688,
      "969": 689,
      "493": 690,
      "884": 691,
      "255": 692,
      "235": 693,
      "129": 694,
      "100": 695,
      "326": 696,
      "247": 697,
      "352": 698,
      "645": 699,
      "24": 700,
      "754": 701,
      "860": 702,
      "861": 703,
      "919": 704,
      "670": 705,
      "357": 706,
      "163": 707,
      "11": 708,
      "648": 709,
      "249": 710,
      "459": 711,
      "20": 712,
      "444": 713,
      "245": 714,
      "548": 715,
      "96": 716,
      "336": 717,
      "292": 718,
      "773": 719,
      "345": 720,
      "67": 721,
      "730": 722,
      "705": 723,
      "432": 724,
      "468": 725,
      "244": 726,
      "521": 727,
      "940": 728,
      "37": 729,
      "367": 730,
      "195": 731,
      "784": 732,
      "439": 733,
      "724": 734,
      "137": 735,
      "937": 736,
      "611": 737,
      "767": 738,
      "95": 739,
      "188": 740,
      "844": 741,
      "571": 742,
      "398": 743,
      "312": 744,
      "285": 745,
      "211": 746,
      "320": 747,
      "1009": 748,
      "935": 749,
      "710": 750,
      "528": 751,
      "890": 752,
      "303": 753,
      "414": 754,
      "297": 755,
      "914": 756,
      "872": 757,
      "936": 758,
      "655": 759,
      "931": 760,
      "813": 761,
      "313": 762,
      "567": 763,
      "706": 764,
      "359": 765,
      "121": 766,
      "741": 767,
      "510": 768,
      "347": 769,
      "360": 770,
      "168": 771,
      "981": 772,
      "753": 773,
      "254": 774,
      "636": 775,
      "54": 776,
      "658": 777,
      "53": 778,
      "301": 779,
      "587": 780,
      "599": 781,
      "688": 782,
      "803": 783,
      "48": 784,
      "847": 785,
      "62": 786,
      "125": 787,
      "304": 788,
      "415": 789,
      "900": 790,
      "425": 791,
      "488": 792,
      "358": 793,
      "333": 794,
      "278": 795,
      "403": 796,
      "501": 797,
      "965": 798,
      "200": 799,
      "466": 800,
      "30": 801,
      "689": 802,
      "535": 803,
      "46": 804,
      "642": 805,
      "799": 806,
      "364": 807,
      "993": 808,
      "549": 809,
      "416": 810,
      "232": 811,
      "19": 812,
      "673": 813,
      "408": 814,
      "182": 815,
      "776": 816,
      "515": 817,
      "423": 818,
      "344": 819,
      "942": 820,
      "701": 821,
      "343": 822,
      "677": 823,
      "50": 824,
      "269": 825,
      "348": 826,
      "7": 827,
      "266": 828,
      "793": 829,
      "530": 830,
      "376": 831,
      "716": 832,
      "915": 833,
      "473": 834,
      "258": 835,
      "570": 836,
      "419": 837,
      "328": 838,
      "674": 839,
      "280": 840,
      "777": 841,
      "262": 842,
      "523": 843,
      "859": 844,
      "354": 845,
      "184": 846,
      "967": 847,
      "218": 848,
      "81": 849,
      "686": 850,
      "183": 851,
      "888": 852,
      "89": 853,
      "783": 854,
      "913": 855,
      "660": 856,
      "78": 857,
      "762": 858,
      "497": 859,
      "909": 860,
      "485": 861,
      "920": 862,
      "718": 863,
      "905": 864,
      "848": 865,
      "552": 866,
      "953": 867,
      "369": 868,
      "440": 869,
      "107": 870,
      "355": 871,
      "309": 872,
      "976": 873,
      "34": 874,
      "583": 875,
      "424": 876,
      "340": 877,
      "437": 878,
      "170": 879,
      "651": 880,
      "134": 881,
      "751": 882,
      "714": 883,
      "298": 884,
      "36": 885,
      "56": 886,
      "904": 887,
      "759": 888,
      "441": 889,
      "389": 890,
      "194": 891,
      "588": 892,
      "295": 893,
      "643": 894,
      "175": 895,
      "454": 896,
      "646": 897,
      "825": 898,
      "233": 899,
      "226": 900,
      "713": 901,
      "155": 902,
      "404": 903,
      "283": 904,
      "554": 905,
      "755": 906,
      "220": 907,
      "871": 908,
      "261": 909,
      "83": 910,
      "71": 911,
      "250": 912,
      "426": 913,
      "555": 914,
      "1001": 915,
      "550": 916,
      "917": 917,
      "58": 918,
      "720": 919,
      "869": 920,
      "487": 921,
      "230": 922,
      "338": 923,
      "21": 924,
      "325": 925,
      "635": 926,
      "573": 927,
      "943": 928,
      "483": 929,
      "123": 930,
      "854": 931,
      "774": 932,
      "722": 933,
      "9": 934,
      "412": 935,
      "749": 936,
      "431": 937,
      "88": 938,
      "126": 939,
      "28": 940,
      "667": 941,
      "105": 942,
      "40": 943,
      "679": 944,
      "264": 945,
      "63": 946,
      "973": 947,
      "879": 948,
      "193": 949,
      "595": 950,
      "745": 951,
      "445": 952,
      "998": 953,
      "362": 954,
      "945": 955,
      "580": 956,
      "991": 957,
      "775": 958,
      "901": 959,
      "843": 960,
      "697": 961,
      "109": 962,
      "375": 963,
      "167": 964,
      "954": 965,
      "241": 966,
      "800": 967,
      "812": 968,
      "384": 969,
      "612": 970,
      "492": 971,
      "841": 972,
      "428": 973,
      "462": 974,
      "631": 975,
      "282": 976,
      "207": 977,
      "602": 978,
      "321": 979,
      "119": 980,
      "49": 981,
      "43": 982,
      "1000": 983,
      "201": 984,
      "902": 985,
      "735": 986,
      "458": 987,
      "995": 988,
      "644": 989,
      "342": 990,
      "819": 991,
      "314": 992,
      "489": 993,
      "1013": 994,
      "143": 995
    },
    "unk_token": "<unk>"
  }
}